In [25]:
import pandas as pd
df = pd.read_csv("Advertising.csv")
df = df.iloc[:, 1:len(df)]
df.head()

      TV  radio  newspaper  sales
0  230.1   37.8       69.2   22.1
1   44.5   39.3       45.1   10.4
2   17.2   45.9       69.3    9.3
3  151.5   41.3       58.5   18.5
4  180.8   10.8       58.4   12.9

In [26]:
X = df.drop("sales", axis=1)
y = df[["sales"]]

In [27]:
X.head()

      TV  radio  newspaper
0  230.1   37.8       69.2
1   44.5   39.3       45.1
2   17.2   45.9       69.3
3  151.5   41.3       58.5
4  180.8   10.8       58.4

In [28]:
y.head()

   sales
0   22.1
1   10.4
2    9.3
3   18.5
4   12.9

In [29]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error
from sklearn.linear_model import LinearRegression
import numpy as np

In [30]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=1)

In [31]:
X_train.head()

        TV  radio  newspaper
108   13.1    0.4       25.6
107   90.4    0.3       23.2
189   18.7   12.1       23.4
14   204.1   32.9       46.0
56     7.3   28.1       41.4

In [32]:
y_train.head()

     sales
108    5.3
107    8.7
189    6.7
14    19.0
56     5.5

In [33]:
X_test.head()

        TV  radio  newspaper
58   210.8   49.6       37.7
40   202.5   22.3       31.6
34    95.7    1.4        7.4
102  280.2   10.1       21.4
184  253.8   21.3       30.0

In [34]:
y_test.head()

     sales
58    23.8
40    16.6
34     9.5
102   14.8
184   17.6

In [35]:
lm = LinearRegression()
model = lm.fit(X_train, y_train)

In [36]:
# Find training error
np.sqrt(mean_squared_error(y_train, model.predict(X_train)))

1.736902590147092

In [37]:
# Find test error
np.sqrt(mean_squared_error(y_test, model.predict(X_test)))

1.4113417558581587

In [38]:
# K-Fold Cross Validation
from sklearn.model_selection import cross_val_score
cross_val_score(model, X_train, y_train, cv=10, scoring="neg_mean_squared_error")

array([-1.62375953, -3.81875608, -3.43828142, -2.27748673, -7.25325414,
       -1.88303708, -2.80517715, -3.68594486, -1.12810834, -3.96330989])

In [39]:
# CV mse
np.mean(-cross_val_score(model, X_train, y_train, cv=10, scoring="neg_mean_squared_error"))

3.1877115209443563

In [40]:
# CV rmse
np.sqrt(np.mean(-cross_val_score(model, X_train, y_train, cv=10, scoring="neg_mean_squared_error")))

1.7854163438661461